# UFuncs: Index Preservation

In [2]:
import pandas as pd
import numpy as np

In [3]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0,10,4))
ser

0    6
1    3
2    7
3    4
dtype: int32

In [4]:
df = pd.DataFrame(rng.randint(0,10, (3, 4)),
                 columns=["A","B","C","D"])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [5]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [6]:
np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

# UFuncs: Index Alignment
### Index Alignment in Series

In [7]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

In [8]:
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [9]:
area.index | population.index

C:\Users\User\AppData\Local\Temp\ipykernel_16368\3572280633.py:1: FutureWarning: Index.__or__ operating as a set operation is deprecated, in the future this will be a logical operation matching Series.__or__.  Use index.union(other) instead.
  area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [10]:
A = pd.Series([2,4,6], index=[0,1,2])
B = pd.Series([1,3,5], index=[1,2,3])

In [11]:
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [12]:
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

### Index Alignment in DataFrame

In [13]:
A = pd.DataFrame(rng.randint(0,20,(2,2)),
                columns=list("AB"))
A

   A   B
0  1  11
1  5   1

In [14]:
B = pd.DataFrame(rng.randint(0,10,(3,3)),
                columns=list("BAC"))
B

   B  A  C
0  4  0  9
1  5  8  0
2  9  2  6

In [15]:
A + B

      A     B   C
0   1.0  15.0 NaN
1  13.0   6.0 NaN
2   NaN   NaN NaN

In [16]:
fill = A.stack().mean()
A.add(B, fill_value = fill)

      A     B     C
0   1.0  15.0  13.5
1  13.0   6.0   4.5
2   6.5  13.5  10.5

The following table lists Python operators and their equivalent Pandas object methods:

Python Operator	Pandas Method(s)
* (+)	add()
* (-)	sub(), subtract()
* (*)	mul(), multiply()
* (/)	truediv(), div(), divide()
* (//)	floordiv()
* (%)	mod()
* (**)	pow()

# UFuncs: Operations Between DataFrame and Series

In [17]:
A = rng.randint(10,size = (3,4))

In [18]:
A

array([[3, 8, 2, 4],
       [2, 6, 4, 8],
       [6, 1, 3, 8]])

In [19]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-1, -2,  2,  4],
       [ 3, -7,  1,  4]])

In [20]:
A[0]

array([3, 8, 2, 4])

In [21]:
df = pd.DataFrame(A,columns=list("QRST"))
df.iloc[0]

Q    3
R    8
S    2
T    4
Name: 0, dtype: int32

In [22]:
df.subtract(df["R"], axis = 0)

   Q  R  S  T
0 -5  0 -6 -4
1 -4  0 -2  2
2  5  0  2  7

In [24]:
df

   Q  R  S  T
0  3  8  2  4
1  2  6  4  8
2  6  1  3  8

In [23]:
halfrow = df.iloc[0, ::2]
halfrow

Q    3
S    2
Name: 0, dtype: int32

In [25]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -1.0 NaN  2.0 NaN
2  3.0 NaN  1.0 NaN